
// Завдання 8
// Напиши скрипт управління формою логіна.

// Обробка відправлення форми form.login-form повинна відбуватися відповідно до події submit.
// Під час відправлення форми сторінка не повинна перезавантажуватися.
// Якщо у формі є незаповнені поля, виводь alert з попередженням про те, що всі поля повинні бути заповнені.
// Якщо користувач заповнив усі поля і відправив форму, збери значення полів в об'єкт, де ім'я поля буде ім'ям властивості, а значення поля - значенням властивості. Для доступу до елементів форми використовуй властивість elements.
// Виведи об'єкт із введеними даними в консоль і очисти значення полів форми методом reset.


const loginForm = document.querySelector(".login-form");

loginForm.addEventListener('submit', dataSend);

function dataSend(event) {
  event.preventDefault(); //скасовую дію браузера за замовчуванням
  
  const {
    elements: { // бере всі елементи форми
      password, // бере значення у поля форми з відповідним ім'ям (name="password")
      email, 
    } 
  } = event.currentTarget; // бере значення полів форми у момент її відправки (при натисканні на кнопку форми - подія submit)

  if (email.value === "" || password.value === "" ) {
    return console.log("всі поля мають бути заповнені");
  }
  
  console.log("password is:", password.value);
  console.log("email is:", email.value);
  event.currentTarget.reset(); // скидає всі поля форми (="")
};
  







